runs/exp01-baseline-load/run/k6-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/ubuntu/canvas-k8s/testing/load_test/canvas-load.js
        output: Prometheus remote write (http://127.0.0.1:30090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 10 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 2 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m00.9s/5m0s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m01.8s/5m0s

running (0m03.0s), 10/10 VUs, 16 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m02.9s/5m0s

running (0m04.0s), 10/10 VUs, 23 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m03.9s/5m0s

running (0m05.0s), 10/10 VUs, 32 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m04.9s/5m0s

running (0m06.0s), 10/10 VUs, 39 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m05.9s/5m0s

running (0m07.0s), 10/10 VUs, 46 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m06.8s/5m0s

running (0m08.0s), 10/10 VUs, 51 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m07.9s/5m0s

running (0m09.0s), 10/10 VUs, 62 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m08.8s/5m0s

running (0m10.0s), 10/10 VUs, 68 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m09.8s/5m0s

running (0m11.0s), 10/10 VUs, 78 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m10.9s/5m0s

running (0m12.0s), 10/10 VUs, 85 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m11.8s/5m0s

running (0m13.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m12.9s/5m0s

running (0m14.0s), 10/10 VUs, 98 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m13.9s/5m0s

running (0m15.0s), 10/10 VUs, 107 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m14.8s/5m0s

running (0m16.0s), 10/10 VUs, 113 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m15.9s/5m0s

running (0m17.0s), 10/10 VUs, 121 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m16.9s/5m0s

running (0m18.0s), 10/10 VUs, 128 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m17.9s/5m0s

running (0m19.0s), 10/10 VUs, 135 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m18.9s/5m0s

running (0m20.0s), 10/10 VUs, 143 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m19.9s/5m0s

running (0m21.0s), 10/10 VUs, 148 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m20.9s/5m0s

running (0m22.0s), 10/10 VUs, 154 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m21.8s/5m0s

running (0m23.0s), 10/10 VUs, 161 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m22.9s/5m0s

running (0m24.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m23.9s/5m0s

running (0m25.0s), 10/10 VUs, 179 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m24.9s/5m0s

running (0m26.0s), 10/10 VUs, 185 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m25.9s/5m0s

running (0m27.0s), 10/10 VUs, 194 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m26.9s/5m0s

running (0m28.0s), 10/10 VUs, 202 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m27.9s/5m0s

running (0m29.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m28.8s/5m0s

running (0m30.0s), 10/10 VUs, 219 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m29.9s/5m0s

running (0m31.0s), 10/10 VUs, 224 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m30.9s/5m0s

running (0m32.0s), 10/10 VUs, 231 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m31.9s/5m0s

running (0m33.0s), 10/10 VUs, 238 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m32.9s/5m0s

running (0m34.0s), 10/10 VUs, 245 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m33.9s/5m0s

running (0m35.0s), 10/10 VUs, 252 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m34.8s/5m0s

running (0m36.0s), 10/10 VUs, 263 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m35.9s/5m0s

running (0m37.0s), 10/10 VUs, 268 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m36.9s/5m0s

running (0m38.0s), 10/10 VUs, 277 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m37.8s/5m0s

running (0m39.0s), 10/10 VUs, 282 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m38.9s/5m0s

running (0m40.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m39.8s/5m0s

running (0m41.0s), 10/10 VUs, 298 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m40.9s/5m0s

running (0m42.0s), 10/10 VUs, 305 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m41.9s/5m0s

running (0m43.0s), 10/10 VUs, 313 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m42.9s/5m0s

running (0m44.0s), 10/10 VUs, 321 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m43.9s/5m0s

running (0m45.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m44.9s/5m0s

running (0m46.0s), 10/10 VUs, 334 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m45.9s/5m0s

running (0m47.0s), 10/10 VUs, 342 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m46.8s/5m0s

running (0m48.0s), 10/10 VUs, 348 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m47.9s/5m0s

running (0m49.0s), 10/10 VUs, 356 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m48.9s/5m0s

running (0m50.0s), 10/10 VUs, 365 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m49.9s/5m0s

running (0m51.0s), 10/10 VUs, 371 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m50.9s/5m0s

running (0m52.0s), 10/10 VUs, 377 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m51.9s/5m0s

running (0m53.0s), 10/10 VUs, 384 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m52.8s/5m0s

running (0m54.0s), 10/10 VUs, 392 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m53.8s/5m0s

running (0m55.0s), 10/10 VUs, 398 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m54.8s/5m0s

running (0m56.0s), 10/10 VUs, 406 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m55.8s/5m0s

running (0m57.0s), 10/10 VUs, 416 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m56.9s/5m0s

running (0m58.0s), 10/10 VUs, 421 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m57.9s/5m0s

running (0m59.0s), 10/10 VUs, 430 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m58.9s/5m0s

running (1m00.0s), 10/10 VUs, 439 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m59.8s/5m0s

running (1m01.0s), 10/10 VUs, 445 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  1m00.9s/5m0s

running (1m02.0s), 10/10 VUs, 451 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m01.9s/5m0s

running (1m03.0s), 10/10 VUs, 459 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m02.9s/5m0s

running (1m04.0s), 10/10 VUs, 464 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m03.8s/5m0s

running (1m05.0s), 10/10 VUs, 475 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m04.9s/5m0s

running (1m06.0s), 10/10 VUs, 481 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m05.8s/5m0s

running (1m07.0s), 10/10 VUs, 491 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m06.9s/5m0s

running (1m08.0s), 10/10 VUs, 498 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m07.9s/5m0s

running (1m09.0s), 10/10 VUs, 507 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m08.9s/5m0s

running (1m10.0s), 10/10 VUs, 515 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m09.9s/5m0s

running (1m11.0s), 10/10 VUs, 519 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m10.9s/5m0s

running (1m12.0s), 10/10 VUs, 528 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m11.9s/5m0s

running (1m13.0s), 10/10 VUs, 535 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m12.9s/5m0s

running (1m14.0s), 10/10 VUs, 544 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m13.9s/5m0s

running (1m15.0s), 10/10 VUs, 551 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m14.8s/5m0s

running (1m16.0s), 10/10 VUs, 559 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m15.9s/5m0s

running (1m17.0s), 10/10 VUs, 564 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m16.9s/5m0s

running (1m18.0s), 10/10 VUs, 570 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m17.9s/5m0s

running (1m19.0s), 10/10 VUs, 579 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m18.9s/5m0s

running (1m20.0s), 10/10 VUs, 585 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m19.9s/5m0s

running (1m21.0s), 10/10 VUs, 592 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m20.8s/5m0s

running (1m22.0s), 10/10 VUs, 600 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m21.9s/5m0s

running (1m23.0s), 10/10 VUs, 607 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m22.8s/5m0s

running (1m24.0s), 10/10 VUs, 616 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m23.9s/5m0s

running (1m25.0s), 10/10 VUs, 622 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m24.8s/5m0s

running (1m26.0s), 10/10 VUs, 628 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m25.8s/5m0s

running (1m27.0s), 10/10 VUs, 634 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m26.9s/5m0s

running (1m28.0s), 10/10 VUs, 644 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m27.9s/5m0s

running (1m29.0s), 10/10 VUs, 651 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m28.8s/5m0s

running (1m30.0s), 10/10 VUs, 661 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m29.9s/5m0s

running (1m31.0s), 10/10 VUs, 667 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m30.8s/5m0s

running (1m32.0s), 10/10 VUs, 674 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m31.9s/5m0s

running (1m33.0s), 10/10 VUs, 682 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m32.9s/5m0s

running (1m34.0s), 10/10 VUs, 689 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m33.9s/5m0s

running (1m35.0s), 10/10 VUs, 699 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m34.9s/5m0s

running (1m36.0s), 10/10 VUs, 703 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m35.9s/5m0s

running (1m37.0s), 10/10 VUs, 711 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m36.8s/5m0s

running (1m38.0s), 10/10 VUs, 719 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m37.9s/5m0s
time="2026-04-01T15:52:11Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:11Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:11Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console

running (1m39.0s), 10/10 VUs, 729 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m38.8s/5m0s
time="2026-04-01T15:52:11Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:11Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:11Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:11Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:12Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:12Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:12Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:12Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:12Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console

running (1m40.0s), 10/10 VUs, 738 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m39.9s/5m0s
time="2026-04-01T15:52:12Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:12Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:12Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:12Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:13Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:13Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:13Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:13Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console

running (1m41.0s), 10/10 VUs, 746 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m40.9s/5m0s
time="2026-04-01T15:52:13Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:13Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:13Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:14Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:14Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console
time="2026-04-01T15:52:14Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console

running (1m42.0s), 10/10 VUs, 752 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m41.9s/5m0s
time="2026-04-01T15:52:14Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 502. Body preview: <html> <head><title>502 Bad Gateway</title></head> <body> <center><h1>502 Bad Gateway</h1></center> <hr><center>nginx/1.24.0 (Ubuntu)</center> </body> </html> " source=console

running (1m43.0s), 10/10 VUs, 760 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m42.8s/5m0s

running (1m44.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m43.9s/5m0s

running (1m45.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m44.9s/5m0s

running (1m46.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m45.9s/5m0s

running (1m47.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m46.8s/5m0s

running (1m48.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m47.9s/5m0s

running (1m49.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m48.9s/5m0s

running (1m50.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m49.9s/5m0s

running (1m51.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m50.9s/5m0s

running (1m52.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m51.9s/5m0s

running (1m53.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m52.8s/5m0s

running (1m54.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m53.9s/5m0s

running (1m55.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m54.9s/5m0s

running (1m56.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m55.8s/5m0s

running (1m57.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m56.8s/5m0s

running (1m58.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m57.9s/5m0s

running (1m59.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  1m58.9s/5m0s

running (2m00.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  1m59.8s/5m0s

running (2m01.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  2m00.9s/5m0s

running (2m02.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m01.8s/5m0s

running (2m03.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m02.8s/5m0s

running (2m04.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m03.9s/5m0s

running (2m05.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m04.9s/5m0s

running (2m06.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m05.8s/5m0s

running (2m07.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m06.9s/5m0s

running (2m08.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m07.9s/5m0s

running (2m09.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m08.9s/5m0s

running (2m10.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m09.9s/5m0s

running (2m11.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m10.9s/5m0s

running (2m12.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m11.9s/5m0s

running (2m13.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m12.8s/5m0s

running (2m14.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m13.8s/5m0s

running (2m15.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m14.9s/5m0s

running (2m16.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m15.9s/5m0s

running (2m17.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m16.8s/5m0s

running (2m18.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m17.9s/5m0s

running (2m19.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m18.9s/5m0s

running (2m20.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m19.9s/5m0s

running (2m21.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m20.9s/5m0s

running (2m22.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m21.8s/5m0s

running (2m23.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m22.8s/5m0s

running (2m24.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m23.8s/5m0s

running (2m25.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m24.9s/5m0s

running (2m26.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m25.8s/5m0s

running (2m27.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m26.9s/5m0s

running (2m28.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m27.8s/5m0s

running (2m29.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m28.8s/5m0s

running (2m30.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m29.9s/5m0s

running (2m31.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m30.9s/5m0s

running (2m32.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m31.9s/5m0s

running (2m33.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m32.8s/5m0s

running (2m34.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m33.8s/5m0s

running (2m35.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m34.9s/5m0s

running (2m36.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m35.9s/5m0s

running (2m37.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m36.8s/5m0s

running (2m38.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m37.9s/5m0s

running (2m39.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m38.9s/5m0s

running (2m40.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m39.8s/5m0s

running (2m41.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m40.8s/5m0s

running (2m42.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m41.8s/5m0s
time="2026-04-01T15:53:14Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active\": request timeout"
time="2026-04-01T15:53:14Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 0. Body preview: " source=console
time="2026-04-01T15:53:15Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active\": request timeout"
time="2026-04-01T15:53:15Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 0. Body preview: " source=console
time="2026-04-01T15:53:15Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/dashboard/dashboard_cards\": request timeout"
time="2026-04-01T15:53:15Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 0. Body preview: " source=console
time="2026-04-01T15:53:15Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active\": request timeout"
time="2026-04-01T15:53:15Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 0. Body preview: " source=console
time="2026-04-01T15:53:15Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active\": request timeout"
time="2026-04-01T15:53:15Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 0. Body preview: " source=console
time="2026-04-01T15:53:15Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active\": request timeout"
time="2026-04-01T15:53:15Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 0. Body preview: " source=console
time="2026-04-01T15:53:15Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active\": request timeout"
time="2026-04-01T15:53:15Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 0. Body preview: " source=console

running (2m43.0s), 10/10 VUs, 764 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m42.9s/5m0s
time="2026-04-01T15:53:15Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active\": request timeout"
time="2026-04-01T15:53:15Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 0. Body preview: " source=console
time="2026-04-01T15:53:15Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active\": request timeout"
time="2026-04-01T15:53:15Z" level=error msg="[courses] GET http://canvas.io.vn/api/v1/courses?per_page=20&enrollment_state=active returned 0. Body preview: " source=console
time="2026-04-01T15:53:16Z" level=warning msg="Request Failed" error="Get \"http://canvas.io.vn/api/v1/dashboard/dashboard_cards\": request timeout"
time="2026-04-01T15:53:16Z" level=error msg="[dashboard-cards] GET http://canvas.io.vn/api/v1/dashboard/dashboard_cards returned 0. Body preview: " source=console

running (2m44.0s), 10/10 VUs, 766 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m43.8s/5m0s

running (2m45.0s), 10/10 VUs, 773 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m44.9s/5m0s

running (2m46.0s), 10/10 VUs, 773 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m45.8s/5m0s

running (2m47.0s), 10/10 VUs, 773 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m46.9s/5m0s

running (2m48.0s), 10/10 VUs, 773 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m47.8s/5m0s

running (2m49.0s), 10/10 VUs, 774 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m48.8s/5m0s

running (2m50.0s), 10/10 VUs, 783 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m49.8s/5m0s

running (2m51.0s), 10/10 VUs, 792 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m50.8s/5m0s

running (2m52.0s), 10/10 VUs, 798 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m51.9s/5m0s

running (2m53.0s), 10/10 VUs, 805 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m52.9s/5m0s

running (2m54.0s), 10/10 VUs, 812 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m53.8s/5m0s

running (2m55.0s), 10/10 VUs, 819 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m54.9s/5m0s

running (2m56.0s), 10/10 VUs, 830 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m55.9s/5m0s

running (2m57.0s), 10/10 VUs, 839 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m56.9s/5m0s

running (2m58.0s), 10/10 VUs, 848 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m57.9s/5m0s

running (2m59.0s), 10/10 VUs, 854 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  2m58.9s/5m0s

running (3m00.0s), 10/10 VUs, 860 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  2m59.9s/5m0s

running (3m01.0s), 10/10 VUs, 866 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  3m00.9s/5m0s

running (3m02.0s), 10/10 VUs, 875 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m01.9s/5m0s

running (3m03.0s), 10/10 VUs, 883 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m02.9s/5m0s

running (3m04.0s), 10/10 VUs, 890 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m03.9s/5m0s

running (3m05.0s), 10/10 VUs, 898 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m04.9s/5m0s

running (3m06.0s), 10/10 VUs, 905 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m05.8s/5m0s

running (3m07.0s), 10/10 VUs, 913 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m06.9s/5m0s

running (3m08.0s), 10/10 VUs, 920 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m07.9s/5m0s

running (3m09.0s), 10/10 VUs, 930 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m08.9s/5m0s

running (3m10.0s), 10/10 VUs, 935 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m09.9s/5m0s

running (3m11.0s), 10/10 VUs, 944 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m10.8s/5m0s

running (3m12.0s), 10/10 VUs, 951 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m11.8s/5m0s

running (3m13.0s), 10/10 VUs, 960 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m12.9s/5m0s

running (3m14.0s), 10/10 VUs, 968 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m13.8s/5m0s

running (3m15.0s), 10/10 VUs, 976 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m14.8s/5m0s

running (3m16.0s), 10/10 VUs, 984 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m15.8s/5m0s

running (3m17.0s), 10/10 VUs, 994 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m16.8s/5m0s

running (3m18.0s), 10/10 VUs, 1000 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m17.9s/5m0s

running (3m19.0s), 10/10 VUs, 1008 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m18.8s/5m0s

running (3m20.0s), 10/10 VUs, 1017 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m19.9s/5m0s

running (3m21.0s), 10/10 VUs, 1025 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m20.8s/5m0s

running (3m22.0s), 10/10 VUs, 1034 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m21.8s/5m0s

running (3m23.0s), 10/10 VUs, 1042 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m22.9s/5m0s

running (3m24.0s), 10/10 VUs, 1053 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m23.8s/5m0s

running (3m25.0s), 10/10 VUs, 1059 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m24.9s/5m0s

running (3m26.0s), 10/10 VUs, 1068 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m25.8s/5m0s

running (3m27.0s), 10/10 VUs, 1073 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m26.8s/5m0s

running (3m28.0s), 10/10 VUs, 1081 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m27.9s/5m0s

running (3m29.0s), 10/10 VUs, 1090 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m28.9s/5m0s

running (3m30.0s), 10/10 VUs, 1095 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m29.9s/5m0s

running (3m31.0s), 10/10 VUs, 1104 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m30.8s/5m0s

running (3m32.0s), 10/10 VUs, 1110 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m31.8s/5m0s

running (3m33.0s), 10/10 VUs, 1118 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m32.9s/5m0s

running (3m34.0s), 10/10 VUs, 1127 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m33.8s/5m0s

running (3m35.0s), 10/10 VUs, 1133 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m34.8s/5m0s

running (3m36.0s), 10/10 VUs, 1141 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m35.9s/5m0s

running (3m37.0s), 10/10 VUs, 1147 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m36.9s/5m0s

running (3m38.0s), 10/10 VUs, 1156 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m37.9s/5m0s

running (3m39.0s), 10/10 VUs, 1161 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m38.8s/5m0s

running (3m40.0s), 10/10 VUs, 1172 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m39.9s/5m0s

running (3m41.0s), 10/10 VUs, 1177 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m40.9s/5m0s

running (3m42.0s), 10/10 VUs, 1186 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m41.8s/5m0s

running (3m43.0s), 10/10 VUs, 1192 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m42.9s/5m0s

running (3m44.0s), 10/10 VUs, 1200 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m43.9s/5m0s

running (3m45.0s), 10/10 VUs, 1210 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m44.9s/5m0s

running (3m46.0s), 10/10 VUs, 1215 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m45.8s/5m0s

running (3m47.0s), 10/10 VUs, 1221 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m46.9s/5m0s

running (3m48.0s), 10/10 VUs, 1233 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m47.8s/5m0s

running (3m49.0s), 10/10 VUs, 1235 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m48.8s/5m0s

running (3m50.0s), 10/10 VUs, 1245 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m49.8s/5m0s

running (3m51.0s), 10/10 VUs, 1251 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m50.9s/5m0s

running (3m52.0s), 10/10 VUs, 1259 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m51.9s/5m0s

running (3m53.0s), 10/10 VUs, 1265 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m52.9s/5m0s

running (3m54.0s), 10/10 VUs, 1274 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m53.9s/5m0s

running (3m55.0s), 10/10 VUs, 1280 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m54.9s/5m0s

running (3m56.0s), 10/10 VUs, 1291 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m55.9s/5m0s

running (3m57.0s), 10/10 VUs, 1297 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m56.9s/5m0s

running (3m58.0s), 10/10 VUs, 1307 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m57.9s/5m0s

running (3m59.0s), 10/10 VUs, 1311 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  3m58.9s/5m0s

running (4m00.0s), 10/10 VUs, 1319 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  3m59.8s/5m0s

running (4m01.0s), 10/10 VUs, 1324 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  4m00.8s/5m0s

running (4m02.0s), 10/10 VUs, 1334 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m01.9s/5m0s

running (4m03.0s), 10/10 VUs, 1342 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m02.9s/5m0s

running (4m04.0s), 10/10 VUs, 1350 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m03.8s/5m0s

running (4m05.0s), 10/10 VUs, 1357 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m04.8s/5m0s

running (4m06.0s), 10/10 VUs, 1365 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m05.8s/5m0s

running (4m07.0s), 10/10 VUs, 1372 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m06.8s/5m0s

running (4m08.0s), 10/10 VUs, 1382 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m07.8s/5m0s

running (4m09.0s), 10/10 VUs, 1388 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m08.9s/5m0s

running (4m10.0s), 10/10 VUs, 1399 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m09.9s/5m0s

running (4m11.0s), 10/10 VUs, 1406 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m10.9s/5m0s

running (4m12.0s), 10/10 VUs, 1416 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m11.8s/5m0s

running (4m13.0s), 10/10 VUs, 1422 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m12.8s/5m0s

running (4m14.0s), 10/10 VUs, 1430 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m13.9s/5m0s

running (4m15.0s), 10/10 VUs, 1440 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m14.9s/5m0s

running (4m16.0s), 10/10 VUs, 1449 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m15.9s/5m0s

running (4m17.0s), 10/10 VUs, 1456 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m16.9s/5m0s

running (4m18.0s), 10/10 VUs, 1465 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m17.9s/5m0s

running (4m19.0s), 10/10 VUs, 1474 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m18.9s/5m0s

running (4m20.0s), 10/10 VUs, 1479 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m19.9s/5m0s

running (4m21.0s), 10/10 VUs, 1486 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m20.9s/5m0s

running (4m22.0s), 10/10 VUs, 1494 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m21.9s/5m0s

running (4m23.0s), 10/10 VUs, 1502 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m22.8s/5m0s

running (4m24.0s), 10/10 VUs, 1513 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m23.9s/5m0s

running (4m25.0s), 10/10 VUs, 1518 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m24.9s/5m0s

running (4m26.0s), 10/10 VUs, 1527 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m25.9s/5m0s

running (4m27.0s), 10/10 VUs, 1536 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m26.9s/5m0s

running (4m28.0s), 10/10 VUs, 1542 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m27.9s/5m0s

running (4m29.0s), 10/10 VUs, 1549 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m28.8s/5m0s

running (4m30.0s), 10/10 VUs, 1558 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m29.8s/5m0s

running (4m31.0s), 10/10 VUs, 1566 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m30.9s/5m0s

running (4m32.0s), 10/10 VUs, 1575 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m31.9s/5m0s

running (4m33.0s), 10/10 VUs, 1583 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m32.9s/5m0s

running (4m34.0s), 10/10 VUs, 1591 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m33.9s/5m0s

running (4m35.0s), 10/10 VUs, 1597 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m34.9s/5m0s

running (4m36.0s), 10/10 VUs, 1608 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m35.8s/5m0s

running (4m37.0s), 10/10 VUs, 1616 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m36.8s/5m0s

running (4m38.0s), 10/10 VUs, 1624 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m37.9s/5m0s

running (4m39.0s), 10/10 VUs, 1634 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m38.8s/5m0s

running (4m40.0s), 10/10 VUs, 1639 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m39.9s/5m0s

running (4m41.0s), 10/10 VUs, 1650 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m40.9s/5m0s

running (4m42.0s), 10/10 VUs, 1656 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m41.9s/5m0s

running (4m43.0s), 10/10 VUs, 1665 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m42.9s/5m0s

running (4m44.0s), 10/10 VUs, 1671 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m43.8s/5m0s

running (4m45.0s), 10/10 VUs, 1678 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m44.9s/5m0s

running (4m46.0s), 10/10 VUs, 1688 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m45.8s/5m0s

running (4m47.0s), 10/10 VUs, 1695 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m46.8s/5m0s

running (4m48.0s), 10/10 VUs, 1703 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m47.8s/5m0s

running (4m49.0s), 10/10 VUs, 1709 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m48.9s/5m0s

running (4m50.0s), 10/10 VUs, 1718 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m49.9s/5m0s

running (4m51.0s), 10/10 VUs, 1724 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m50.9s/5m0s

running (4m52.0s), 10/10 VUs, 1730 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m51.9s/5m0s

running (4m53.0s), 10/10 VUs, 1740 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m52.8s/5m0s

running (4m54.0s), 10/10 VUs, 1747 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m53.8s/5m0s

running (4m55.0s), 10/10 VUs, 1755 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m54.8s/5m0s

running (4m56.0s), 10/10 VUs, 1761 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m55.8s/5m0s

running (4m57.0s), 10/10 VUs, 1768 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m56.9s/5m0s

running (4m58.0s), 10/10 VUs, 1775 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m57.9s/5m0s

running (4m59.0s), 10/10 VUs, 1783 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  4m58.9s/5m0s

running (5m00.0s), 10/10 VUs, 1790 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  4m59.9s/5m0s

running (5m01.0s), 07/10 VUs, 1795 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<3000' p(95)=70.38ms

    http_req_failed
    ✓ 'rate<0.05' rate=2.05%


  █ TOTAL RESULTS 

    checks_total.......: 1803   5.978078/s
    checks_succeeded...: 97.94% 1766 out of 1803
    checks_failed......: 2.05%  37 out of 1803

    ✓ /api/v1/courses status is 200
    ✗ courses status is 200
      ↳  97% — ✓ 1316 / ✗ 27
    ✗ dashboard cards status is 200
      ↳  97% — ✓ 449 / ✗ 10

    HTTP
    http_req_duration..............: avg=399.13ms min=614.88µs med=39.55ms max=1m0s  p(90)=52.46ms p(95)=70.38ms
      { expected_response:true }...: avg=67.68ms  min=31.34ms  med=39.58ms max=5.25s p(90)=51.44ms p(95)=67.98ms
    http_req_failed................: 2.05%  37 out of 1803
    http_reqs......................: 1803   5.978078/s

    EXECUTION
    iteration_duration.............: avg=1.67s    min=518.38ms med=1.33s   max=1m1s  p(90)=1.9s    p(95)=1.98s  
    iterations.....................: 1802   5.974763/s
    vus............................: 7      min=7          max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 2.8 MB 9.3 kB/s
    data_sent......................: 410 kB 1.4 kB/s



running (5m01.6s), 00/10 VUs, 1802 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  5m0s